tutorials/2nrel5mw/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
   location    "0000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"
 
dimensions      [0 1 -1 0 0 0 0];
 
internalField   uniform $U0;

boundaryField
{
    lower
    {
        type            slip;
    }

    upper
    {
        type            slip;
    }
    west
    {
        type            fixedValue;
        value           $U0;
    }
    east
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    south
    {
        type            cyclic;
    }
    north
    {
        type            cyclic;
    }


}



// ************************************************************************* //
