tutorials/2nrel5mw/system/cloud_1D
    cloudData_1D
    {
      type                 sets;
      functionObjectLibs   ("libsampling.so");
      enabled              true;
      interpolationScheme  cell;
      outputControl        timeStep;
      outputInterval       1;
      setFormat            raw;
      fields
      (
         U
      );

      sets
      (
         sampleplane_1D
         {
            type         cloud;
            axis         xyz;
            points       (

            (446.005 1115.005 0.005)
            (446.005 1120.005 0.005)
            (446.005 1125.005 0.005)
            (446.005 1130.005 0.005)
            (446.005 1135.005 0.005)
            (446.005 1140.005 0.005)
            (446.005 1145.005 0.005)
            (446.005 1150.005 0.005)
            (446.005 1155.005 0.005)
            (446.005 1160.005 0.005)
            (446.005 1165.005 0.005)
            (446.005 1170.005 0.005)
            (446.005 1175.005 0.005)
            (446.005 1180.005 0.005)
            (446.005 1185.005 0.005)
            (446.005 1190.005 0.005)
            (446.005 1195.005 0.005)
            (446.005 1200.005 0.005)
            (446.005 1205.005 0.005)
            (446.005 1210.005 0.005)
            (446.005 1215.005 0.005)
            (446.005 1220.005 0.005)
            (446.005 1225.005 0.005)
            (446.005 1230.005 0.005)
            (446.005 1235.005 0.005)
            (446.005 1240.005 0.005)
            (446.005 1245.005 0.005)
            (446.005 1250.005 0.005)
            (446.005 1255.005 0.005)
            (446.005 1260.005 0.005)
            (446.005 1265.005 0.005)
            (446.005 1270.005 0.005)
            (446.005 1275.005 0.005)
            (446.005 1280.005 0.005)
            (446.005 1285.005 0.005)
            (446.005 1290.005 0.005)
            (446.005 1295.005 0.005)
            (446.005 1300.005 0.005)
            (446.005 1305.005 0.005)
            (446.005 1310.005 0.005)
            (446.005 1315.005 0.005)
            (446.005 1320.005 0.005)
            (446.005 1325.005 0.005)
            (446.005 1330.005 0.005)
            (446.005 1335.005 0.005)
            (446.005 1340.005 0.005)
            (446.005 1345.005 0.005)
            (446.005 1350.005 0.005)
            (446.005 1355.005 0.005)
            (446.005 1360.005 0.005)
            (446.005 1365.005 0.005)
            (446.005 1370.005 0.005)
            (446.005 1375.005 0.005)
            (446.005 1380.005 0.005)
            (446.005 1385.005 0.005)
            (446.005 1390.005 0.005)
            (446.005 1395.005 0.005)
            (446.005 1400.005 0.005)
            (446.005 1405.005 0.005)
            (446.005 1410.005 0.005)
            (446.005 1415.005 0.005)
            (446.005 1420.005 0.005)
            (446.005 1425.005 0.005)
            (446.005 1430.005 0.005)
            (446.005 1435.005 0.005)
            (446.005 1440.005 0.005)
            (446.005 1445.005 0.005)
            (446.005 1450.005 0.005)
            (446.005 1455.005 0.005)
            (446.005 1460.005 0.005)
            (446.005 1465.005 0.005)
            (446.005 1470.005 0.005)
            (446.005 1475.005 0.005)
            (446.005 1480.005 0.005)
            (446.005 1485.005 0.005)
            (446.005 1490.005 0.005)
            (446.005 1495.005 0.005)
            (446.005 1500.005 0.005)
            (446.005 1505.005 0.005)
            (446.005 1510.005 0.005)
            (446.005 1515.005 0.005)
            (446.005 1520.005 0.005)
            (446.005 1525.005 0.005)
            (446.005 1530.005 0.005)
            (446.005 1535.005 0.005)
            (446.005 1540.005 0.005)
            (446.005 1545.005 0.005)
            (446.005 1550.005 0.005)
            (446.005 1555.005 0.005)
            (446.005 1560.005 0.005)
            (446.005 1565.005 0.005)
            (446.005 1570.005 0.005)
            (446.005 1575.005 0.005)
            (446.005 1580.005 0.005)
            (446.005 1585.005 0.005)
            (446.005 1590.005 0.005)
            (446.005 1595.005 0.005)
            (446.005 1600.005 0.005)
            (446.005 1605.005 0.005)
            (446.005 1610.005 0.005)
...
            (446.005 1885.005 250.005)

                          );
         }
      );
    }
