tutorials/2nrel5mw/system/sliceDataMean
      sliceDataMean
      {
          type                 surfaces;
          functionObjectLibs   ("libsampling.so");
          enabled              true;
          interpolationScheme  isThisNeeded;
          outputControl        timeStep;
          outputInterval       5000;
          surfaceFormat        vtk;
          fields
          (
              UAvg
          );
          surfaces
          (
              slice_0
              {
                  type         plane;
                  basePoint    (1500 1500 98.189);
                  normalVector (0 0 1);
                  interpolate  false;
                  triangulate  false;
              }

              slice_1
              {
                  type         plane;
                  basePoint    (1500.1 1500.1 98.189);
                  normalVector (0 1 0);
                  interpolate  false;
                  triangulate  false;
              }

           ); 
      }

