tutorials/2nrel5mw/system/topoSetDict.local.2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name         local.2;
        type         cellSet;
        action       new;
        source       boxToCell;
        sourceInfo
        {
            box (199.99 1268.99 -0.01) (2240.01 1731.01 250.01);
        }
    }
);

// ************************************************************************* //
